app/Http/Livewire/Scolarite/DashboardComponent.php

SELECT * FROM "annees" WHERE "encours" = 1 LIMIT 1
SELECT * FROM "inscriptions" WHERE "annee_id" = 1
SELECT * FROM "inscriptions" WHERE "annee_id" = 1 and "status" = 'approved'
SELECT * FROM "inscriptions" WHERE "annee_id" = 1 and "status" = 'rejected'
SELECT * FROM "inscriptions" WHERE "annee_id" = 1 and "status" = 'pending'
SELECT * FROM "inscriptions" WHERE "annee_id" = 1 and "created_at" > '2022-11-27'
SELECT * FROM "inscriptions" WHERE "annee_id" = 1 and "status" = 'approved' and "created_at" > '2022-11-27'
SELECT * FROM "inscriptions" WHERE "annee_id" = 1 and "status" = 'rejected' and "created_at" > '2022-11-27'
SELECT * FROM "inscriptions" WHERE "annee_id" = 1 and "status" = 'pending' and "created_at" > '2022-11-27'
---
    public function mount()
    {
        // set user email vefied if not yet
        if (!Auth::user()->hasVerifiedEmail()) {
            Auth::user()->update(['email_verified_at' => now()]);
        }

        $moisCourrant = Carbon::today()->subMonth(1)->toDateString();


        $this->annee_courante = Annee::where('encours', true)->first();

        $this->inscrits = Inscription::where('annee_id', $this->annee_courante->id)->get();
        $inscritsValid = Inscription::where('annee_id', $this->annee_courante->id)->where('status', InscriptionStatus::approved->name)->get();
        $inscritsReject = Inscription::where('annee_id', $this->annee_courante->id)->where('status', InscriptionStatus::rejected->name)->get();
        $inscritsPending = Inscription::where('annee_id', $this->annee_courante->id)->where('status', InscriptionStatus::pending->name)->get();

        $moisInscrits = Inscription::where('annee_id', $this->annee_courante->id)->where('created_at', '>', $moisCourrant)->get();
        $moisInscritsValid = Inscription::where('annee_id', $this->annee_courante->id)->where('status', InscriptionStatus::approved->name)->where('created_at', '>', $moisCourrant)->get();
        $moisInscritsReject = Inscription::where('annee_id', $this->annee_courante->id)->where('status', InscriptionStatus::rejected->name)->where('created_at', '>', $moisCourrant)->get();
        $moisInscritspending = Inscription::where('annee_id', $this->annee_courante->id)->where('status', InscriptionStatus::pending->name)->where('created_at', '>', $moisCourrant)->get();