app/Http/Livewire/Scolarite/Enseignant/EnseignantIndexComponent.php

    public function mount()
    {
        $this->enseignants = Enseignant::latest()->get();
---
SELECT * FROM "enseignants" ORDER BY "created_at" DESC