app/Http/Livewire/Scolarite/Responsable/ResponsableIndexComponent.php

SELECT * FROM "responsables" ORDER BY "nom" ASC
---
    public function loadData()
    {
        return Responsable::orderBy('nom', 'ASC')->get();