app/Http/Livewire/Finance/Frais/FraisIndexComponent.php

    public function mount()
    {
        $this->annee_id = Annee::id();
        $this->sections = Section::orderBy('nom')->get();
---
SELECT * FROM "sections" ORDER BY "nom" ASC

    public function loadData()
    {
        $this->loadAvailableClasses();
        //Todo: we will need to specify the année scolaire;
        $this->frais = Frais::where('annee_id', $this->annee_id)->orderBy('nom', 'ASC')->get();
---
SELECT * FROM "frais" WHERE "annee_id" = 1 ORDER BY "nom" ASC

    private function loadAvailableClasses()
    {
        if ($this->filiere_id > 0) {
            $filiere = Filiere::find($this->filiere_id);
            $this->classes = $filiere->classes ?? [];
        } else if ($this->option_id > 0) {
            $option = Option::find($this->option_id);
            $this->classes = $option->classes ?? [];
        } else if ($this->section_id > 0) {
            $section = Section::find($this->section_id);
            $this->classes = $section->classes ?? [];
        } else {
            $this->classes = [];
        }

        $this->sections = Section::orderBy('nom')->get();
---
SELECT * FROM "sections" ORDER BY "nom" ASC