app/Http/Livewire/Scolarite/Classe/ClasseShowComponent.php

SELECT "enseignants".*, "cours_enseignants"."classe_id" as "pivot_classe_id", "cours_enseignants"."enseignant_id" as "pivot_enseignant_id" FROM "enseignants" inner join "cours_enseignants" on "enseignants"."id" = "cours_enseignants"."enseignant_id" WHERE "cours_enseignants"."classe_id" = 14 and "annee_id" = 1
---
    public function addCours()
    {
        $this->validate([
            'cours_enseignant.cours_id' => [
                'required',
                Rule::unique('cours_enseignants', 'cours_id')->where(function ($query) {
                    return $query->where('classe_id', $this->classe->id)
                        ->where('annee_id', Annee::encours()->id);
                })],
            'cours_enseignant.enseignant_id' => Rule::requiredIf(!$this->classe->primaire()), // si la classe n'est pas primaire
        ]);