app/Http/Livewire/Scolarite/Classe/ClasseIndexComponent.php

SELECT * FROM "classes" ORDER BY "code" ASC
---
    public function loadData()
    {
        $this->classes = Classe::orderBy('code')->get();