app/Http/Livewire/Scolarite/Resultat/Block/ResultatsBlockComponent.php

    public function selectInscription($id)
    {
        $this->inscription = Inscription::find($id);
        $temp = $this->inscription->resultats()->where('custom_property', $this->resultatType)->first();
---
SELECT * FROM "inscriptions" WHERE "inscriptions"."id" = '01gn94t7vz01v9mw9kswteb7be' LIMIT 1
SELECT * FROM "resultats" WHERE "resultats"."inscription_id" = '01gn94t7vz01v9mw9kswteb7be' and "resultats"."inscription_id" IS not NULL and "custom_property" = 1 LIMIT 1

    public function updateResultat(){
        $this->validate();
        $this->resultat->custom_property = $this->resultatType->value;
        $this->resultat->annee_id = Annee::id();
        $this->resultat->classe_id = $this->classe->id;
        $this->resultat->inscription_id = $this->inscription->id;
        //$this->resultat->conduite = Conduite::b->name;

        $done = Resultat::updateOrCreate(
            [
                'inscription_id'=>$this->resultat->inscription_id,
                'classe_id'=>$this->resultat->classe_id,
                'annee_id'=>$this->resultat->annee_id,
                'custom_property'=>$this->resultat->custom_property,
                ],
            [
                'pourcentage'=>$this->resultat->pourcentage,
                'place'=>$this->resultat->place,
                'conduite'=>$this->resultat->conduite,
            ]
        );
---
INSERT INTO "resultats" ("inscription_id", "classe_id", "annee_id", "custom_property", "pourcentage", "place", "conduite", "id", "updated_at", "created_at") VALUES ('01gmxmd69a31eyarr5pnedrgzn', 15, 1, 1, '12', '12', , '01gn01qfjsaa2szenvcjg4gntz', '2022-12-23 19:50:38', '2022-12-23 19:50:38')
SELECT * FROM "resultats" WHERE ("inscription_id" = '01gmxmd69a31eyarr5pnedrgzn' and "classe_id" = 15 and "annee_id" = 1 and "custom_property" = 1) LIMIT 1