app/Http/Livewire/Finance/Perception/PerceptionIndexComponent.php

SELECT * FROM "perceptions" WHERE "annee_id" = 1 ORDER BY "created_at" DESC
---
    public function render()
    {
        $perceptionsRequest = Perception::where('annee_id', $this->annee_id);
        $this->perceptions = $perceptionsRequest->orderBy('created_at', 'DESC')->get();