app/Http/Livewire/Finance/Perception/PerceptionEditComponent.php

    private function chooseSuitableFrais()
    {
        // $this->loadInscriptionFrais();

        $this->inscription = $this->perception->inscription;//Inscription::find($this->inscription_id);
        $cclasse = Classe::find($this->inscription->classe_id);
        $fofo = Frais::
        where('annee_id', $this->annee_id)
            ->whereNot('type', FraisType::inscription)
            ->where('classable_type', 'like', '%Classe')
            ->where('classable_id', $cclasse->id)
            ->orderBy('nom')
            ->get();

        $this->frais = $fofo;

        $cfiliere = Filiere::find($cclasse->filierable_id);

        if ($cfiliere) {
            $frais2 = Frais::
            where('annee_id', $this->annee_id)
                ->whereNot('type', FraisType::inscription)
                ->where('classable_type', 'like', '%Filiere')
                ->where('classable_id', $cfiliere->id)
                ->orderBy('nom')
                ->get();
            $this->frais = $this->frais->merge($frais2);

            $foption = Option::find($cfiliere->option_id);
---
SELECT * FROM "classes" WHERE "classes"."id" = 13 LIMIT 1
SELECT * FROM "filieres" WHERE "filieres"."id" = 1 LIMIT 1
SELECT * FROM "options" WHERE "options"."id" = 2 LIMIT 1

                $this->frais = $this->frais->merge($frais2f);
            }

            $fsection = Section::find($cfiliere->section_id);
---
SELECT * FROM "sections" WHERE "sections"."id" IS NULL LIMIT 1