app/Http/Livewire/Finance/Perception/PerceptionEditComponent.php

    private function reloadData()
    {
        $this->inscriptions = Inscription::where('annee_id', Annee::id())->get();

        /*if ($this->perception->inscription_id) {
            $this->inscription = Inscription::find($this->inscription_id);
---
SELECT * FROM "inscriptions" WHERE "annee_id" = 1
SELECT * FROM "inscriptions" WHERE "inscriptions"."id" = '01gna6t3mj9k9s25m3ydg1mk28' LIMIT 1

    private function chooseSuitableFrais()
    {
       // $this->loadInscriptionFrais();

        $this->inscription = $this->perception->inscription;//Inscription::find($this->inscription_id);
        $cclasse = Classe::find($this->inscription->classe_id);
        $fofo = Frais::
        where('annee_id', $this->annee_id)
            ->where('classable_type', 'like', '%Classe')
            ->where('classable_id', $cclasse->id)
            ->orderBy('nom')
            ->get();

        $this->frais = $fofo;

        $cfiliere = Filiere::find($cclasse->filierable_id);

       if($cfiliere) {
            $frais2 = Frais::
            where('annee_id', $this->annee_id)
                ->where('classable_type', 'like', '%Filiere')
                ->where('classable_id', $cfiliere->id)
                ->orderBy('nom')
                ->get();
            $this->frais = $this->frais->merge($frais2);

           $foption = Option::find($cfiliere->option_id);
---
SELECT * FROM "classes" WHERE "classes"."id" = 11 LIMIT 1
SELECT * FROM "inscriptions" WHERE "inscriptions"."id" = '01gn94t7sjc0ht6sppk51wfk7g' LIMIT 1
SELECT * FROM "filieres" WHERE "filieres"."id" = 1 LIMIT 1
SELECT * FROM "options" WHERE "options"."id" = 1 LIMIT 1

               $this->frais = $this->frais->merge($frais2f);
           }

           $fsection = Section::find($cfiliere->section_id);
---
SELECT * FROM "sections" WHERE "sections"."id" = 3 LIMIT 1

           }
        }

        $coption = Option::find($cclasse->filierable_id);
---
SELECT * FROM "options" WHERE "options"."id" = 1 LIMIT 1

                ->get();
            $this->frais = $this->frais->merge($frais3);

           $osection = Section::find($coption->section_id);
---
SELECT * FROM "sections" WHERE "sections"."id" = 3 LIMIT 1

           }
        }

        $csection = Section::find($cclasse->filierable_id);
---
SELECT * FROM "sections" WHERE "sections"."id" = 1 LIMIT 1