app/Http/Livewire/Scolarite/Classe/Cours/Edit.php

    public function loadFilieresData()
    {

        $this->sections = Section::orderBy('nom')->get();
---
SELECT * FROM "sections" ORDER BY "nom" ASC