app/Http/Livewire/Finance/DepenseType/DepenseTypeIndexComponent.php

SELECT * FROM "depense_types" ORDER BY "nom" ASC
---
    public function loadData()
    {
        $this->depenseTypes = DepenseType::orderBy('nom')->get();