app/Http/Livewire/Finance/Depense/DepenseIndexComponent.php

SELECT * FROM "depenses" WHERE "annee_id" = 1 ORDER BY "created_at" DESC
---
    public function loadData()
    {
        $this->types = DepenseType::orderBy('nom')->get();
        $this->depenses = Depense::where('annee_id', $this->annee_id)->orderBy('created_at', 'DESC')->get();