app/Http/Livewire/Scolarite/Inscription/InscriptionIndexComponent.php

SELECT * FROM "annees" WHERE "encours" = 1 LIMIT 1
---
    public function render()
    {
        $this->annee_courante = Annee::where('encours', true)->first();

SELECT * FROM "inscriptions" WHERE "annee_id" = 1 ORDER BY "status" ASC
---
    public function loadData()
    {
        $query = Inscription::query();
        $query->where('annee_id', $this->annee_courante->id)->orderBy('status', 'ASC');