app/Traits/HasMedia.php

INSERT INTO "media" ("mime_type", "filename", "location", "custom_property", "size", "mediable_id", "mediable_type", "id", "updated_at", "created_at") VALUES ('application/pdf', 'Compte rendu reunion 23-12.docx.pdf', 'devoir_reponses/01gn9n0nn41wr9ktjw5fdqf2c2/documents/DiT5ZKqP6Z038N81soGLBzGlt4q2eQ302K9LT7JL.pdf', 'document', 183722, '01gn9n0nn41wr9ktjw5fdqf2c2', 'App\Models\DevoirReponse', '01gn9n0nnfm1xzw5ht0zmx8179', '2022-12-27 13:20:52', '2022-12-27 13:20:52')
---
    public function upload(UploadedFile $file, Model $entity, MediaType $mediaType): Media
    {
        return $entity->media()->create([
            'mime_type' => $file->getMimeType(),
            'filename' => $file->getClientOriginalName(),
            'location' => $file->store("{$entity->getTable()}/{$entity->id}/{$mediaType->folder()}", 'public'),
            'custom_property' => $mediaType->value,
            'size' => $file->getSize(),
        ]);