app/Http/Livewire/Scolarite/Devoir/DevoirIndexComponent.php

    public function loadData(): void
    {
        $this->devoirs = Devoir::latest()->get();
---
SELECT * FROM "devoirs" ORDER BY "created_at" DESC