app/Http/Livewire/Scolarite/Devoir/DevoirShowComponent.php

            $this->devoir_reponse->devoir_id = $this->devoir->id;
            $this->devoir_reponse->eleve_id = $this->eleve->id;

            $this->devoir_reponse->save();
---
INSERT INTO "devoir_reponses" ("contenu", "devoir_id", "eleve_id", "id", "updated_at", "created_at") VALUES ('Wer', '01gn94t8d6jb5vm2q86pxzvm92', '01gn94t7q9pvbjya24svhdkr1h', '01gn9n0nn41wr9ktjw5fdqf2c2', '2022-12-27 13:20:52', '2022-12-27 13:20:52')

    public function updatedMatricule()
    {
        if (Str::length($this->matricule) == 10) {
            $this->validate([
                'matricule' => ['required', 'string', 'exists:eleves,matricule'],
            ]);
            $this->eleve = Eleve::whereHas('inscriptions', function ($query) {
                $query->where('classe_id', $this->devoir->classe_id)
                    ->where('annee_id', $this->devoir->annee_id);
            })->where('matricule', $this->matricule)->first();
---
SELECT * FROM "classes" WHERE "classes"."id" = 6 LIMIT 1
SELECT * FROM "eleves" WHERE "matricule" = '2022030003' LIMIT 1