app/Models/Annee.php

    public static function encours(): self
    {
        return self::where('encours', true)->latest()->first();
---
SELECT * FROM "annees" WHERE "encours" = 1 ORDER BY "created_at" DESC LIMIT 1