app/Models/Classe.php

SELECT * FROM "resultats" WHERE "resultats"."inscription_id" = '01gn94t7tbzq5tgkg233j3a98j' and "resultats"."inscription_id" IS not NULL
---
    public function inscriptionsAsOfPlaceOfResultats(ResultatType $resultatType)
    {
        $inscriptions_temp = $this->inscriptions->all();
        usort($inscriptions_temp, function ($insc1, $insc2) use ($resultatType) {
            $r1 = $insc1->resultats->where('custom_property', $resultatType)->first();
            $r2 = $insc2->resultats->where('custom_property', $resultatType)->first();
            return $r1?->place > $r2?->place;
        });

SELECT * FROM "sections" WHERE "sections"."id" = 3 LIMIT 1
---
    public function getSectionAttribute(): ?Section
    {
        return Section::find($this->section_id);

SELECT * FROM "enseignants" WHERE "enseignants"."id" IS NULL LIMIT 1
---
    public function getEnseignantAttribute(): ?Enseignant
    {
        return Enseignant::find($this->enseignant_id);