app/Models/Cours.php

    public function scopeClasse(Builder $query, Classe $classe): Builder
    {
        // cours where section_id = classe.section_id and not in cours_enseignants where classe_id = classe.id and annee_id = annee encours
        return $query->where('section_id', $classe->section_id)
            ->whereDoesntHave('coursEnseignants', function (Builder $query) use ($classe) {
                $query->where('classe_id', $classe->id)
                    ->where('annee_id', Annee::encours()->id);
            });
---
SELECT * FROM "cours_enseignants" WHERE "cours_enseignants"."cours_id" = 10 and "cours_enseignants"."cours_id" IS not NULL
SELECT * FROM "enseignants" WHERE "enseignants"."id" = '01gmxmd6fkyc92kj61c5t4rt6k' LIMIT 1