app/Models/Eleve.php

SELECT "resultats".*, "inscriptions"."eleve_id" as "laravel_through_key" FROM "resultats" inner join "inscriptions" on "inscriptions"."id" = "resultats"."inscription_id" WHERE "inscriptions"."eleve_id" = '01gmxmd66f2qmp04jvtt3r9f59' ORDER BY "custom_property" ASC
---
    public function resultats(): HasManyThrough
    {
        return $this->hasManyThrough(Resultat::class, Inscription::class)->orderBy('custom_property');