app/Models/Enseignant.php

    public function getClasseAttribute()
    {
        return $this->classes()->where('annee_id', Annee::encours()->id)->first();
---
SELECT "classes".*, "classe_enseignants"."enseignant_id" as "pivot_enseignant_id", "classe_enseignants"."classe_id" as "pivot_classe_id" FROM "classes" inner join "classe_enseignants" on "classes"."id" = "classe_enseignants"."classe_id" WHERE "classe_enseignants"."enseignant_id" = '01gn6tssvw08xy1w3v1amveb5v' and "annee_id" = 1 LIMIT 1

    public function cours()
    {
        return $this->belongsToMany(Cours::class, 'cours_enseignants')->where('annee_id', Annee::encours()->id)->withPivot('classe_id');
---
SELECT "cours".*, "cours_enseignants"."enseignant_id" as "pivot_enseignant_id", "cours_enseignants"."cours_id" as "pivot_cours_id" FROM "cours" inner join "cours_enseignants" on "cours"."id" = "cours_enseignants"."cours_id" WHERE "cours_enseignants"."enseignant_id" = '01gn94t80chn1s0v80tnwp9w3j' and "annee_id" = 1 and "classe_id" = 14