app/Models/Frais.php

SELECT * FROM "sections" WHERE "sections"."id" = 1 LIMIT 1
---
    public function getClassableAttribute(): mixed
    {
        if (str_ends_with($this->classable_type, 'Classe')) {
            return Classe::find($this->classable_id);
        } elseif (str_ends_with($this->classable_type, 'Filiere')) {
            return Filiere::find($this->classable_id);
        } elseif (str_ends_with($this->classable_type, 'Option')) {
            return Option::find($this->classable_id);
        } elseif (str_ends_with($this->classable_type, 'Section')) {
            return Section::find($this->classable_id);