app/Http/Livewire/Finance/Revenu/RevenuIndexComponent.php

    public function loadData()
    {
        // todo: we should consider annee_id when fetching data
        $this->revenus = Revenu::where('annee_id', $this->annee_id)->orderBy('created_at', 'DESC')->get();
---
SELECT * FROM "revenus" WHERE "annee_id" = 1 ORDER BY "created_at" DESC