app/Http/Livewire/Scolarite/Eleve/EleveShowComponent.php

SELECT * FROM "annees" WHERE "encours" = 1 LIMIT 1
SELECT * FROM "inscriptions" WHERE ("eleve_id" = '01gmxmd66f2qmp04jvtt3r9f59' and "annee_id" = 1) LIMIT 1
SELECT * FROM "sections" ORDER BY "nom" ASC
SELECT * FROM "responsables" ORDER BY "nom" ASC
---
    public function mount($eleve)
    {
        $eleve = Eleve::find($eleve);
        $this->authorize('view', $eleve);

        $this->devoirs = $eleve->devoirs;

        $this->eleve = $eleve;
        $this->annee_courante = Annee::where('encours', true)->first();
        $this->inscription = Inscription::where(['eleve_id' => $this->eleve->id, 'annee_id' => $this->annee_courante->id])->first();
        $this->responsable_relation = $this->eleve->responsable_eleve?->relation ?? null;
        $this->responsable_relation2 = ResponsableRelation::pere;
        // $this->profile_url =Helpers::fakePicsum($this->eleve->id, 120, 120);
        //  dd($this->profile_url);
        // $this->inscription_status = $this->inscription->status->value;

        $this->sections = Section::orderBy('nom')->get();
        $this->inscription2_categorie = InscriptionCategorie::normal;
        $this->preloadEleve();

        $this->responsables = Responsable::orderBy('nom')->get();