app/Http/Controllers/Admin/UserController.php

SELECT * FROM "users" ORDER BY "id" DESC
---
    public function index()
    {

        // get user not super admins, use spatie permission
        $users = User::getStaff();

        return view('users.index', compact('users'))->with('title', __('Utilisateurs'));